---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForColumn
source: html/99683223-da0b-4a67-149f-cb4a1e9ef184.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForColumn Property

Symbolic cutback distance to be applied to all columns.

## Syntax (C#)
```csharp
public double SymbolicCutbackForColumn { get; set; }
```